import content from "../data/descriptionTexts.json";

const Description = () => {
  return (
    <div>
      <h2 className="text-4xl text-center mb-8">
        Переваги LiFePO4 технологій для автономного електроживлення
      </h2>
      <div className="grid grid-cols-2 gap-6">
        <div>
          <div className="h-96 rounded-lg overflow-hidden">
            <img
              src="batteryasups.webp"
              alt="Battery as UPS"
              className="w-full object-cover h-full"
            />
          </div>
        </div>
        <div>
          <p className="text-pretty">
            LiFePO4 батареї забезпечують надійне та безпечне автономне
            електроживлення для будинків і бізнесу. Вони мають високу стійкість
            до перегріву та механічних пошкоджень, що робить їх безпечним
            вибором для критичних систем. Тривалий термін служби до 5000 циклів
            заряду-розряду дозволяє використовувати їх багато років без втрати
            ємності. Хоча початкова вартість цих батарей вища, ніж у
            традиційних, вони економічно вигідні завдяки високій
            енергоефективності та мінімальним витратам на обслуговування.
            LiFePO4 технології ідеально підходять для інтеграції з
            відновлюваними джерелами енергії, такими як сонячні панелі, що
            підвищує енергонезалежність. Вони допомагають уникнути перебоїв
            електропостачання та забезпечують стабільну роботу всіх підключених
            пристроїв. Безпека, довговічність і екологічність роблять ці батареї
            оптимальним вибором для сучасного дому та офісу. Це надійне рішення
            для енергетичної незалежності у світі нестабільного
            енергопостачання. LiFePO4 — це технологія, що забезпечує майбутнє,
            де енергія завжди під контролем.
          </p>
        </div>
      </div>
    </div>
  );
};

export default Description;
